Updated README.md and ModulesManager.md
ModulesManager.md now uses Mermaid diagram
